Revit 2027 API
BuiltInFailures.GridChainSketchFailures Class
 Failures related to the GridChain sketch.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.GridChainSketchFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class GridChainSketchFailures
Public NotInheritable Class GridChainSketchFailures
public ref class GridChainSketchFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type GridChainSketchFailures = class end
The BuiltInFailures.GridChainSketchFailures type exposes the following members.
Properties
Name | Description
ClosedLoop |  GridChain sketch contains a closed loop.
InvalidSketch |  Sketch is invalid. Grid sketch must consist of a single open loop with no intersecting lines.
MoreThanOneLoop |  GridChain sketch contains more than one loop.
OverlappingLines |  GridChain sketch contains lines which overlap.
Top
See Also
Reference
Autodesk.Revit.DB Namespace